<template>
    <div class="player">
        <span class="switch-button" @click="isMini=!isMini"><i :class="isMini?'el-icon-arrow-right':'el-icon-arrow-left'"></i></span>
        <div class="player-box">
            <Aplayer
                    theme="#9B59B6"
                    showLrc
                    :mini="isMini"
                    listMaxHeight="100px"
                    :music="musicList[0]"
                    :list="musicList">
            </Aplayer>
        </div>
    </div>
</template>

<script>
    import Aplayer from 'vue-aplayer'
    export default {
        name: "page-player",
        components: {
            Aplayer
        },
        data() {
            return {
                isMini: true,
                musicList: [{
                    title: '失眠飞行',
                    author: '沈以诚/薛明媛',
                    url: 'http://kealine.top/SE/mp3/0431c434b788a0a8a90f3658c6c0fd5f.mp3',
                    pic: 'http://p1.music.126.net/Bq6Io8lpY1l2HsQ28QKFlw==/109951164083996255.jpg',
                    lrc: '[00:00.000] 作曲 : 接个吻，开一枪\n[00:00.004] 作词 : 沈以诚/刘思鉴/接个吻，开一枪\n[00:00.13] 编曲：接个吻，开一枪\n[00:01.10] 混音：接个吻，开一枪\n[00:02.90] 想要和你低空飞行\n[00:05.70] 和你到处收集氧气\n[00:07.95] 假如迷雾你看不清\n[00:10.74] 不如坠入我的心里\n[00:13.45] 想带你从吵闹到安宁\n[00:15.95] 想带你从多云到转晴\n[00:18.00] 想要为你整理衬衣\n[00:20.70] 为你到处收集诗句\n[00:23.90] 又过了每晚给你热牛奶的时间\n[00:26.70] 床头还写着我们没看完的影片\n[00:29.00] 离开后的时间里你是否还失眠\n[00:31.75]从不熬夜的我也明显黑了眼圈\n[00:34.00] 你送的玩偶依然陪在身边\n[00:39.00] 记忆逐渐浮现从开始到终点 又重演\n[00:43.00] 我想和你 一起闯进森林潜入海底\n[00:48.00] 我想和你 一起看日出到日落天气\n[00:52.95] 我想和你穿过格林威治和时间飞行\n[00:58.00] 我想见你 穿过教堂和人海拥抱你\n[01:02.80] 我想和你\n[01:13.40] 我想和你\n[01:23.90] 想要和你低空飞行\n[01:26.20] 和你到处收集氧气\n[01:28.70] 假如迷雾你看不清\n[01:31.20] 不如坠入我的心里\n[01:34.10] 想带你从吵闹到安宁\n[01:36.85] 想带你从多云到转晴\n[01:38.90] 想要为你整理衬衣\n[01:41.75] 为你到处收集诗句\n[01:44.75] 又过了每晚给你热牛奶的时间\n[01:47.10] 床头还写着我们没看完的影片\n[01:49.90] 离开后的时间里你是否还失眠\n[01:52.60] 从不熬夜的我也明显黑了眼圈\n[01:54.90] 你送的玩偶依然陪在身边\n[01:59.90] 记忆逐渐浮现从开始到终点 又重演\n[02:03.90] 我想和你 一起闯进森林潜入海底\n[02:08.90] 我想和你 一起看日出到日落天气\n[02:13.75] 我想和你穿过格林威治和时间飞行\n[02:18.96] 我想见你 穿过教堂和人海拥抱你\n[02:23.95] 我想和你\n[02:34.00] 我想和你\n[02:44.30] 我想和你\n[02:46.40] 再路过那家咖啡店\n[02:48.78] 熟悉又陌生的地点\n[02:50.70] 驻足希望你的身影会出现\n[02:56.30] 还没说出口的抱歉\n[02:58.75] 曾和你约定的诺言\n[03:00.80] 抬头闭眼让泪流进心里面\n[03:04.65] 我想和你 一起闯进森林潜入海底\n[03:09.75] 我想和你 一起看日出到日落天气\n[03:14.78] 我想和你穿过格林威治和时间飞行\n[03:19.05] 我想见你 穿过教堂和人海拥抱你\n[03:23.45] 母带工程师：殇小谨 \n[03:23.70] 录音室：tweak tone labs ( Beijing ）\n[03:24.00] 录音师：接个吻，开一枪 / 梁家银\n[03:25.10] 电吉他：接个吻，开一枪\n[03:25.45] 木吉他：接个吻，开一枪\n'
                },{
                    title: '失眠飞行',
                    author: '沈以诚/薛明媛',
                    url: 'http://kealine.top/SE/mp3/0431c434b788a0a8a90f3658c6c0fd5f.mp3',
                    pic: 'http://p1.music.126.net/Bq6Io8lpY1l2HsQ28QKFlw==/109951164083996255.jpg',
                    lrc: '[00:00.000] 作曲 : 接个吻，开一枪\n[00:00.004] 作词 : 沈以诚/刘思鉴/接个吻，开一枪\n[00:00.13] 编曲：接个吻，开一枪\n[00:01.10] 混音：接个吻，开一枪\n[00:02.90] 想要和你低空飞行\n[00:05.70] 和你到处收集氧气\n[00:07.95] 假如迷雾你看不清\n[00:10.74] 不如坠入我的心里\n[00:13.45] 想带你从吵闹到安宁\n[00:15.95] 想带你从多云到转晴\n[00:18.00] 想要为你整理衬衣\n[00:20.70] 为你到处收集诗句\n[00:23.90] 又过了每晚给你热牛奶的时间\n[00:26.70] 床头还写着我们没看完的影片\n[00:29.00] 离开后的时间里你是否还失眠\n[00:31.75]从不熬夜的我也明显黑了眼圈\n[00:34.00] 你送的玩偶依然陪在身边\n[00:39.00] 记忆逐渐浮现从开始到终点 又重演\n[00:43.00] 我想和你 一起闯进森林潜入海底\n[00:48.00] 我想和你 一起看日出到日落天气\n[00:52.95] 我想和你穿过格林威治和时间飞行\n[00:58.00] 我想见你 穿过教堂和人海拥抱你\n[01:02.80] 我想和你\n[01:13.40] 我想和你\n[01:23.90] 想要和你低空飞行\n[01:26.20] 和你到处收集氧气\n[01:28.70] 假如迷雾你看不清\n[01:31.20] 不如坠入我的心里\n[01:34.10] 想带你从吵闹到安宁\n[01:36.85] 想带你从多云到转晴\n[01:38.90] 想要为你整理衬衣\n[01:41.75] 为你到处收集诗句\n[01:44.75] 又过了每晚给你热牛奶的时间\n[01:47.10] 床头还写着我们没看完的影片\n[01:49.90] 离开后的时间里你是否还失眠\n[01:52.60] 从不熬夜的我也明显黑了眼圈\n[01:54.90] 你送的玩偶依然陪在身边\n[01:59.90] 记忆逐渐浮现从开始到终点 又重演\n[02:03.90] 我想和你 一起闯进森林潜入海底\n[02:08.90] 我想和你 一起看日出到日落天气\n[02:13.75] 我想和你穿过格林威治和时间飞行\n[02:18.96] 我想见你 穿过教堂和人海拥抱你\n[02:23.95] 我想和你\n[02:34.00] 我想和你\n[02:44.30] 我想和你\n[02:46.40] 再路过那家咖啡店\n[02:48.78] 熟悉又陌生的地点\n[02:50.70] 驻足希望你的身影会出现\n[02:56.30] 还没说出口的抱歉\n[02:58.75] 曾和你约定的诺言\n[03:00.80] 抬头闭眼让泪流进心里面\n[03:04.65] 我想和你 一起闯进森林潜入海底\n[03:09.75] 我想和你 一起看日出到日落天气\n[03:14.78] 我想和你穿过格林威治和时间飞行\n[03:19.05] 我想见你 穿过教堂和人海拥抱你\n[03:23.45] 母带工程师：殇小谨 \n[03:23.70] 录音室：tweak tone labs ( Beijing ）\n[03:24.00] 录音师：接个吻，开一枪 / 梁家银\n[03:25.10] 电吉他：接个吻，开一枪\n[03:25.45] 木吉他：接个吻，开一枪\n'
                },{
                    title: '失眠飞行',
                    author: '沈以诚/薛明媛',
                    url: 'http://kealine.top/SE/mp3/0431c434b788a0a8a90f3658c6c0fd5f.mp3',
                    pic: 'http://p1.music.126.net/Bq6Io8lpY1l2HsQ28QKFlw==/109951164083996255.jpg',
                    lrc: '[00:00.000] 作曲 : 接个吻，开一枪\n[00:00.004] 作词 : 沈以诚/刘思鉴/接个吻，开一枪\n[00:00.13] 编曲：接个吻，开一枪\n[00:01.10] 混音：接个吻，开一枪\n[00:02.90] 想要和你低空飞行\n[00:05.70] 和你到处收集氧气\n[00:07.95] 假如迷雾你看不清\n[00:10.74] 不如坠入我的心里\n[00:13.45] 想带你从吵闹到安宁\n[00:15.95] 想带你从多云到转晴\n[00:18.00] 想要为你整理衬衣\n[00:20.70] 为你到处收集诗句\n[00:23.90] 又过了每晚给你热牛奶的时间\n[00:26.70] 床头还写着我们没看完的影片\n[00:29.00] 离开后的时间里你是否还失眠\n[00:31.75]从不熬夜的我也明显黑了眼圈\n[00:34.00] 你送的玩偶依然陪在身边\n[00:39.00] 记忆逐渐浮现从开始到终点 又重演\n[00:43.00] 我想和你 一起闯进森林潜入海底\n[00:48.00] 我想和你 一起看日出到日落天气\n[00:52.95] 我想和你穿过格林威治和时间飞行\n[00:58.00] 我想见你 穿过教堂和人海拥抱你\n[01:02.80] 我想和你\n[01:13.40] 我想和你\n[01:23.90] 想要和你低空飞行\n[01:26.20] 和你到处收集氧气\n[01:28.70] 假如迷雾你看不清\n[01:31.20] 不如坠入我的心里\n[01:34.10] 想带你从吵闹到安宁\n[01:36.85] 想带你从多云到转晴\n[01:38.90] 想要为你整理衬衣\n[01:41.75] 为你到处收集诗句\n[01:44.75] 又过了每晚给你热牛奶的时间\n[01:47.10] 床头还写着我们没看完的影片\n[01:49.90] 离开后的时间里你是否还失眠\n[01:52.60] 从不熬夜的我也明显黑了眼圈\n[01:54.90] 你送的玩偶依然陪在身边\n[01:59.90] 记忆逐渐浮现从开始到终点 又重演\n[02:03.90] 我想和你 一起闯进森林潜入海底\n[02:08.90] 我想和你 一起看日出到日落天气\n[02:13.75] 我想和你穿过格林威治和时间飞行\n[02:18.96] 我想见你 穿过教堂和人海拥抱你\n[02:23.95] 我想和你\n[02:34.00] 我想和你\n[02:44.30] 我想和你\n[02:46.40] 再路过那家咖啡店\n[02:48.78] 熟悉又陌生的地点\n[02:50.70] 驻足希望你的身影会出现\n[02:56.30] 还没说出口的抱歉\n[02:58.75] 曾和你约定的诺言\n[03:00.80] 抬头闭眼让泪流进心里面\n[03:04.65] 我想和你 一起闯进森林潜入海底\n[03:09.75] 我想和你 一起看日出到日落天气\n[03:14.78] 我想和你穿过格林威治和时间飞行\n[03:19.05] 我想见你 穿过教堂和人海拥抱你\n[03:23.45] 母带工程师：殇小谨 \n[03:23.70] 录音室：tweak tone labs ( Beijing ）\n[03:24.00] 录音师：接个吻，开一枪 / 梁家银\n[03:25.10] 电吉他：接个吻，开一枪\n[03:25.45] 木吉他：接个吻，开一枪\n'
                },{
                    title: '失眠飞行',
                    author: '沈以诚/薛明媛',
                    url: 'http://kealine.top/SE/mp3/0431c434b788a0a8a90f3658c6c0fd5f.mp3',
                    pic: 'http://p1.music.126.net/Bq6Io8lpY1l2HsQ28QKFlw==/109951164083996255.jpg',
                    lrc: '[00:00.000] 作曲 : 接个吻，开一枪\n[00:00.004] 作词 : 沈以诚/刘思鉴/接个吻，开一枪\n[00:00.13] 编曲：接个吻，开一枪\n[00:01.10] 混音：接个吻，开一枪\n[00:02.90] 想要和你低空飞行\n[00:05.70] 和你到处收集氧气\n[00:07.95] 假如迷雾你看不清\n[00:10.74] 不如坠入我的心里\n[00:13.45] 想带你从吵闹到安宁\n[00:15.95] 想带你从多云到转晴\n[00:18.00] 想要为你整理衬衣\n[00:20.70] 为你到处收集诗句\n[00:23.90] 又过了每晚给你热牛奶的时间\n[00:26.70] 床头还写着我们没看完的影片\n[00:29.00] 离开后的时间里你是否还失眠\n[00:31.75]从不熬夜的我也明显黑了眼圈\n[00:34.00] 你送的玩偶依然陪在身边\n[00:39.00] 记忆逐渐浮现从开始到终点 又重演\n[00:43.00] 我想和你 一起闯进森林潜入海底\n[00:48.00] 我想和你 一起看日出到日落天气\n[00:52.95] 我想和你穿过格林威治和时间飞行\n[00:58.00] 我想见你 穿过教堂和人海拥抱你\n[01:02.80] 我想和你\n[01:13.40] 我想和你\n[01:23.90] 想要和你低空飞行\n[01:26.20] 和你到处收集氧气\n[01:28.70] 假如迷雾你看不清\n[01:31.20] 不如坠入我的心里\n[01:34.10] 想带你从吵闹到安宁\n[01:36.85] 想带你从多云到转晴\n[01:38.90] 想要为你整理衬衣\n[01:41.75] 为你到处收集诗句\n[01:44.75] 又过了每晚给你热牛奶的时间\n[01:47.10] 床头还写着我们没看完的影片\n[01:49.90] 离开后的时间里你是否还失眠\n[01:52.60] 从不熬夜的我也明显黑了眼圈\n[01:54.90] 你送的玩偶依然陪在身边\n[01:59.90] 记忆逐渐浮现从开始到终点 又重演\n[02:03.90] 我想和你 一起闯进森林潜入海底\n[02:08.90] 我想和你 一起看日出到日落天气\n[02:13.75] 我想和你穿过格林威治和时间飞行\n[02:18.96] 我想见你 穿过教堂和人海拥抱你\n[02:23.95] 我想和你\n[02:34.00] 我想和你\n[02:44.30] 我想和你\n[02:46.40] 再路过那家咖啡店\n[02:48.78] 熟悉又陌生的地点\n[02:50.70] 驻足希望你的身影会出现\n[02:56.30] 还没说出口的抱歉\n[02:58.75] 曾和你约定的诺言\n[03:00.80] 抬头闭眼让泪流进心里面\n[03:04.65] 我想和你 一起闯进森林潜入海底\n[03:09.75] 我想和你 一起看日出到日落天气\n[03:14.78] 我想和你穿过格林威治和时间飞行\n[03:19.05] 我想见你 穿过教堂和人海拥抱你\n[03:23.45] 母带工程师：殇小谨 \n[03:23.70] 录音室：tweak tone labs ( Beijing ）\n[03:24.00] 录音师：接个吻，开一枪 / 梁家银\n[03:25.10] 电吉他：接个吻，开一枪\n[03:25.45] 木吉他：接个吻，开一枪\n'
                }]
            }
        }
    }
</script>

<style scoped>
    .player{
        position: fixed;
        float: left;
        /*top: 50%;*/
        /*transform: translate(0,-50%);*/
        bottom: 50px;
        max-width: 620px;
        background: rgba(0,0,0,0);
        display: flex;
        justify-content: center;
        align-items: center;
        z-index: 2019;
    }
    .player-box{
        width: 600px;
        float: right;
    }
    .switch-button{
        cursor: pointer;
    }
</style>